import re

f=open("weather.txt", mode="r", encoding="utf8")
content=f.read()
f.close()

pattern=re.compile("[0-9]")  # <-- Εδώ βάζουμε το RE
result=pattern.findall(content)

print(result)
print(len(result))


# ['0', '5', '0', '4', '2', '0', '1', '7', '2', '1', '2', '2', '0', '1', '9', '1', '8', '8', '1', '6', '8', '1', '3', '8', '1', '2', '4', '6', '4', '2', '0', '1', '7', '1', '7', '0', '7', '1', '4', '1', '5', '1', '7', '1', '9', '6', '4', '2', '0', '1', '7', '2', '4', '3', '2', '4', '2', '2', '3', '8', '2', '3', '3', '2', '3', '1', '2', '2', '8', '2', '2', '7', '2', '2', '6']
# 75

# Το προγραμμα με τις κανονικες εκφρασεις βρισκει τους αριθμους που χρησιμοποιηθηκαν μεσα στο κειμενο weather.txt

# και τυπωνει και το πληθος των αριθμων που     